For time series data we use AutoRegression

In [7]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

import statsmodels.api as sm
from statsmodels.tsa.ar_model import AutoReg
from sklearn.metrics import mean_squared_error
from math import sqrt

In [4]:
df = pd.read_csv("E:\AirPassengers.csv")

In [5]:
print(df.shape)
df

(144, 2)

           date  value
0    1949-01-01    112
1    1949-02-01    118
2    1949-03-01    132
3    1949-04-01    129
4    1949-05-01    121
..          ...    ...
139  1960-08-01    606
140  1960-09-01    508
141  1960-10-01    461
142  1960-11-01    390
143  1960-12-01    432

[144 rows x 2 columns]

In [10]:
df.head()

        date  value
0 1949-01-01    112
1 1949-02-01    118
2 1949-03-01    132
3 1949-04-01    129
4 1949-05-01    121

In [9]:
from datetime import datetime
df['date']=pd.to_datetime(df['date'],infer_datetime_format=True)

C:\Users\shobh\AppData\Local\Temp\ipykernel_6876\3223287149.py:2: UserWarning: The argument 'infer_datetime_format' is deprecated and will be removed in a future version. A strict version of it is now the default, see https://pandas.pydata.org/pdeps/0004-consistent-to-datetime-parsing.html. You can safely remove this argument.
  df['date']=pd.to_datetime(df['date'],infer_datetime_format=True)

In [12]:
df = df.set_index('date', inplace=True)

In [17]:
df.head()

AttributeError: 'NoneType' object has no attribute 'head'

In [18]:
df = df.dropna()

AttributeError: 'NoneType' object has no attribute 'dropna'